#include <Windows.h>
#include "Default.h"
#include <iostream>

using namespace std;

void Examination_4x2(char a, char a1, char b, char b1, char c, char c1, char d, char d1, char f, char f1, char f2, char f3, char f4, char f5, char f6, char f7, County doc)
{

	char o;

	if (a == '!' && c == '!' || b == '@' && c1 == '@' || d == '*' && a1 == '*' || b1 == '$' && d1 == '$')
	{
		doc.concidences++;
		PlaySound(TEXT("win2.wav"), NULL, SND_FILENAME | SND_ASYNC);
		cout << endl << "\t\t\t\t\t\t\t Найдено совпадение." << endl;
		cout << endl << "\t\t\t\t\t\t\t Количество совпадений: " << doc.concidences << endl << endl;
		Sleep(1500);
		cout << "\t\t\t\t\t\t\t Продолжить игру    - нажмите [1]" << endl;
		cout << "\t\t\t\t\t\t\t Выйти в меню       - нажмите [2]" << endl;
		cout << "\t\t\t\t\t\t\t Сделайте свой выбор и нажмите Enter: ";

		if (a == '!' && c == '!')
		{
			a = c = f = f2 = ' ';
		}
		if (b == '@' && c1 == '@')
		{
			b = c1 = f1 = f6 = ' ';
		}
		if (d == '*' && a1 == '*')
		{
			d = a1 = f3 = f4 = ' ';
		}
		if (b1 == '$' && d1 == '$')
		{
			b1 = d1 = f5 = f7 = ' ';
		}

		do
		{
			cin >> o;
			PlaySound(TEXT("win.wav"), NULL, SND_FILENAME | SND_ASYNC);

			switch (o)
			{
			case '1':
				system("cls");
				StartGameNext_4x2(a, a1, b, b1, c, c1, d, d1, f, f1, f2, f3, f4, f5, f6, f7, doc);
				break;

			case '2':
				system("cls");
				Menu();
				break;

			default:
				PlaySound(TEXT("fail.wav"), NULL, SND_FILENAME | SND_ASYNC);
				cout << "\t\t\t\t\t\t\t Не правильно сделан выбор. Повторите попытку..." << endl;
				cout << "\t\t\t\t\t\t\t Сделайте свой выбор и нажмите Enter: ";
				break;
			}
		} while (true);

	}
	else
	{
		system("cls");
		doc.count++;
		PlaySound(TEXT("error.wav"), NULL, SND_FILENAME | SND_ASYNC);
		Card_4x2(a, a1, b, b1, c, c1, d, d1, f, f1, f2, f3, f4, f5, f6, f7);
		cout << endl << "\t\t\t\t\t\t\t Совпадений не найдено" << endl << endl;
		cout << endl << "\t\t\t\t\t\t\t Количество переворотов карт: " << doc.count << endl << endl;
		Sleep(1500);

		cout << "\t\t\t\t\t\t\t Начать игру заново    - нажмите [1]" << endl;
		cout << "\t\t\t\t\t\t\t Выйти в меню          - нажмите [2]" << endl;
		cout << "\t\t\t\t\t\t\t Сделайте свой выбор и нажмите Enter: ";

		do
		{
			cin >> o;
			PlaySound(TEXT("win.wav"), NULL, SND_FILENAME | SND_ASYNC);

			switch (o)
			{
			case '1':
				system("cls");
				StartGame_4x2(doc);
				break;

			case '2':
				system("cls");
				Menu();
				break;

			default:
				PlaySound(TEXT("fail.wav"), NULL, SND_FILENAME | SND_ASYNC);
				cout << endl << "\t\t\t\t\t\t\t Не правильно сделан выбор. Повторите попытку..." << endl;
				cout << "\t\t\t\t\t\t\t Сделайте свой выбор и нажмите Enter: ";
				break;
			}
		} while (true);
	}
}

void Card_4x2(char a, char a1, char b, char b1, char c, char c1, char d, char d1, char f, char f1, char f2, char f3, char f4, char f5, char f6, char f7)
{

	//первый ряд
	cout << endl << "\t\t\t\t\t\t\t  -" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  "
		<< "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  "
		<< "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  "
		<< "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  " << endl;

	cout << "\t\t\t\t\t\t\t | " << a << " " << f << " " << f << " " << a << " |" <<
		"| " << b << " " << f1 << " " << f1 << " " << b << " |" <<
		"| " << c << " " << f2 << " " << f2 << " " << c << " |" <<
		"| " << d << " " << f3 << " " << f3 << " " << d << " |" << endl;

	cout << "\t\t\t\t\t\t\t | " << f << " " << f << " " << f << " " << f << " |" <<
		"| " << f1 << " " << f1 << " " << f1 << " " << f1 << " |" <<
		"| " << f2 << " " << f2 << " " << f2 << " " << f2 << " |" <<
		"| " << f3 << " " << f3 << " " << f3 << " " << f3 << " |" << endl;

	cout << "\t\t\t\t\t\t\t | " << f << " " << a << " " << a << " " << f << " |" <<
		"| " << f1 << " " << b << " " << b << " " << f1 << " |" <<
		"| " << f2 << " " << c << " " << c << " " << f2 << " |" <<
		"| " << f3 << " " << d << " " << d << " " << f3 << " |" << endl;

	cout << "\t\t\t\t\t\t\t | " << f << " " << a << " " << a << " " << f << " |" <<
		"| " << f1 << " " << b << " " << b << " " << f1 << " |" <<
		"| " << f2 << " " << c << " " << c << " " << f2 << " |" <<
		"| " << f3 << " " << d << " " << d << " " << f3 << " |" << endl;

	cout << "\t\t\t\t\t\t\t | " << f << " " << f << " " << f << " " << f << " |" <<
		"| " << f1 << " " << f1 << " " << f1 << " " << f1 << " |" <<
		"| " << f2 << " " << f2 << " " << f2 << " " << f2 << " |" <<
		"| " << f3 << " " << f3 << " " << f3 << " " << f3 << " |" << endl;

	cout << "\t\t\t\t\t\t\t | " << a << " " << f << " " << f << " " << a << " |" <<
		"| " << b << " " << f1 << " " << f1 << " " << b << " |" <<
		"| " << c << " " << f2 << " " << f2 << " " << c << " |" <<
		"| " << d << " " << f3 << " " << f3 << " " << d << " |" << endl;

	cout << "\t\t\t\t\t\t\t  -" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  "
		<< "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  "
		<< "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  "
		<< "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  " << endl;

	//второй ряд
	cout << "\t\t\t\t\t\t\t  -" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  "
		<< "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  "
		<< "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  "
		<< "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  " << endl;

	cout << "\t\t\t\t\t\t\t | " << a1 << " " << f4 << " " << f4 << " " << a1 << " |" <<
		"| " << b1 << " " << f5 << " " << f5 << " " << b1 << " |" <<
		"| " << c1 << " " << f6 << " " << f6 << " " << c1 << " |" <<
		"| " << d1 << " " << f7 << " " << f7 << " " << d1 << " |" << endl;

	cout << "\t\t\t\t\t\t\t | " << f4 << " " << f4 << " " << f4 << " " << f4 << " |" <<
		"| " << f5 << " " << f5 << " " << f5 << " " << f5 << " |" <<
		"| " << f6 << " " << f6 << " " << f6 << " " << f6 << " |" <<
		"| " << f7 << " " << f7 << " " << f7 << " " << f7 << " |" << endl;

	cout << "\t\t\t\t\t\t\t | " << f4 << " " << a1 << " " << a1 << " " << f4 << " |" <<
		"| " << f5 << " " << b1 << " " << b1 << " " << f5 << " |" <<
		"| " << f6 << " " << c1 << " " << c1 << " " << f6 << " |" <<
		"| " << f7 << " " << d1 << " " << d1 << " " << f7 << " |" << endl;

	cout << "\t\t\t\t\t\t\t | " << f4 << " " << a1 << " " << a1 << " " << f4 << " |" <<
		"| " << f5 << " " << b1 << " " << b1 << " " << f5 << " |" <<
		"| " << f6 << " " << c1 << " " << c1 << " " << f6 << " |" <<
		"| " << f7 << " " << d1 << " " << d1 << " " << f7 << " |" << endl;

	cout << "\t\t\t\t\t\t\t | " << f4 << " " << f4 << " " << f4 << " " << f4 << " |" <<
		"| " << f5 << " " << f5 << " " << f5 << " " << f5 << " |" <<
		"| " << f6 << " " << f6 << " " << f6 << " " << f6 << " |" <<
		"| " << f7 << " " << f7 << " " << f7 << " " << f7 << " |" << endl;

	cout << "\t\t\t\t\t\t\t | " << a1 << " " << f4 << " " << f4 << " " << a1 << " |" <<
		"| " << b1 << " " << f5 << " " << f5 << " " << b1 << " |" <<
		"| " << c1 << " " << f6 << " " << f6 << " " << c1 << " |" <<
		"| " << d1 << " " << f7 << " " << f7 << " " << d1 << " |" << endl;

	cout << "\t\t\t\t\t\t\t  -" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  "
		<< "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  "
		<< "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  "
		<< "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "-" << "  " << endl;
}